Revit 2027 API
Rebar.GetCrankOffsetLength Method
 Gets the crank offset length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCrankOffsetLength(
	int end
)
Public Function GetCrankOffsetLength (
	end As Integer
) As Double
public:
double GetCrankOffsetLength(
	int end
)
member GetCrankOffsetLength :
        end : int -> float
Parameters
end Int32
 The bar end.
Return Value
Double
 Returns the crank offset length.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
InvalidOperationException |  The bar does not have a valid Rebar Crank Type at the end.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace